In [2]:
import pandas as pd
import numpy as np

In [5]:
emp= pd.read_csv ('../../DB_work/csv/emp.csv')
emp

    empno   ename        job     mgr    hiredate     sal    comm  deptno
0    7369   SMITH      CLERK  7902.0  1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0  1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0  1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0  1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0  1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0  1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0  1981-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0  1987-04-19  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN  1981-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0  1981-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0  1987-05-23  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0  1981-12-03   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0  1981-12-03  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0  1982-01-23  1300.0     NaN      10

In [17]:
#1 select ename, empno from emp
print(emp[['ename', 'empno']])

     ename  empno
0    SMITH   7369
1    ALLEN   7499
2     WARD   7521
3    JONES   7566
4   MARTIN   7654
5    BLAKE   7698
6    CLARK   7782
7    SCOTT   7788
8     KING   7839
9   TURNER   7844
10   ADAMS   7876
11   JAMES   7900
12    FORD   7902
13  MILLER   7934

In [18]:
#2 select ename, hiredate, mgr, deptno from emp
print(emp[['ename', 'hiredate', 'mgr', 'deptno']])

     ename    hiredate     mgr  deptno
0    SMITH  1980-12-17  7902.0      20
1    ALLEN  1981-02-20  7698.0      30
2     WARD  1981-02-22  7698.0      30
3    JONES  1981-04-02  7839.0      20
4   MARTIN  1981-09-28  7698.0      30
5    BLAKE  1981-05-01  7839.0      30
6    CLARK  1981-06-09  7839.0      10
7    SCOTT  1987-04-19  7566.0      20
8     KING  1981-11-17     NaN      10
9   TURNER  1981-09-08  7698.0      30
10   ADAMS  1987-05-23  7788.0      20
11   JAMES  1981-12-03  7698.0      30
12    FORD  1981-12-03  7566.0      20
13  MILLER  1982-01-23  7782.0      10

In [8]:
#3 직업이 SALESMAN인 사원의 이름과 직업 봉급을 출력해보자.
# select ename,job,sal from emp where job = 'SALESMAN';
print(emp[['ename','job','sal']][emp['job']=='SALESMAN']) ## 조건은 뒤에 넣는다.

    ename       job     sal
1   ALLEN  SALESMAN  1600.0
2    WARD  SALESMAN  1250.0
4  MARTIN  SALESMAN  1250.0
9  TURNER  SALESMAN  1500.0

In [13]:
#4 월급이 3000 이상인 사원의 이름과 봉급을 출력하라.
# select ename, sal from emp where sal >= 3000;
emp[['ename','sal']][emp['sal'] >= 3000]

    ename     sal
7   SCOTT  3000.0
8    KING  5000.0
12   FORD  3000.0

In [14]:
#5 사원의 이름과 월급을 출력하되 1000에서 3000까지 받는 사원을 출력하라.
# select ename, sal from emp where sal >=1000 and sal <=3000;
# select ename, sal from emp where sal between 1000 and 3000;
emp[['ename','sal']][emp['sal'].between(1000,3000)]

     ename     sal
1    ALLEN  1600.0
2     WARD  1250.0
3    JONES  2975.0
4   MARTIN  1250.0
5    BLAKE  2850.0
6    CLARK  2450.0
7    SCOTT  3000.0
9   TURNER  1500.0
10   ADAMS  1100.0
12    FORD  3000.0
13  MILLER  1300.0

In [15]:
#6 사원의 이름과 월급을 출력하되 1000에서 3000이 *아닌 사원을 출력하라.
# select ename, sal from emp where sal<1000 and sal>3000;
# select ename, sal from emp where sal not between 1000 and 3000;
emp[['ename','sal']][~ emp['sal'].between(1000,3000)]

    ename     sal
0   SMITH   800.0
8    KING  5000.0
11  JAMES   950.0

#7 직업이 ANALYST, SALESMAN 인 사원의 이름과 직업을 출력하라.
#select ename, job from emp where job in('ANALYST', 'SALESMAN')

    데이터베이스   vs    pandas
1.  between ... and   시리즈.between()
2.  in                isin()
3.  is null           isnull()
4.  like              apply()

In [19]:
emp[['ename','job']][ emp['job'].isin(['ANALYST', 'SALESMAN'])]

     ename       job
1    ALLEN  SALESMAN
2     WARD  SALESMAN
4   MARTIN  SALESMAN
7    SCOTT   ANALYST
9   TURNER  SALESMAN
12    FORD   ANALYST

In [21]:
#8 커미션이 책정되지 않은 사원의 이름과 봉급, 커미션을 출력하자.
# select ename, sal, comm
#from emp
#where comm is NULL

emp[['ename','sal','comm']][ emp['comm'].isnull()]

     ename     sal  comm
0    SMITH   800.0   NaN
3    JONES  2975.0   NaN
5    BLAKE  2850.0   NaN
6    CLARK  2450.0   NaN
7    SCOTT  3000.0   NaN
8     KING  5000.0   NaN
10   ADAMS  1100.0   NaN
11   JAMES   950.0   NaN
12    FORD  3000.0   NaN
13  MILLER  1300.0   NaN

In [22]:
#9 사원의 이름이 'SCOTT' 인 사원의 이름과 봉급을 출력하자.

emp[['ename', 'sal']][emp ['ename'] == 'SCOTT']

   ename     sal
7  SCOTT  3000.0

In [30]:
#10 이름만 추출해서 첫글자, 마지막글자만 출력 해보자.
for i in emp['ename']:
    print(i, i[0], i[-1])

SMITH S H
ALLEN A N
WARD W D
JONES J S
MARTIN M N
BLAKE B E
CLARK C K
SCOTT S T
KING K G
TURNER T R
ADAMS A S
JAMES J S
FORD F D
MILLER M R

In [31]:
#11 마지막 글자가 T로 끝나는 이름을 출력하자.
for i in emp['ename']:
    if i[-1] == 'T':
        print(i)

SCOTT

In [34]:
#12 str + str (O)  /  str + int (X) => 원래 그냥 더하는건 syntax error
#but str+int 결합을 python 코드로 한다면?

for i, j in zip(emp['ename'], emp['sal']):
    print(i + ' + ' + str(j))

SMITH + 800.0
ALLEN + 1600.0
WARD + 1250.0
JONES + 2975.0
MARTIN + 1250.0
BLAKE + 2850.0
CLARK + 2450.0
SCOTT + 3000.0
KING + 5000.0
TURNER + 1500.0
ADAMS + 1100.0
JAMES + 950.0
FORD + 3000.0
MILLER + 1300.0

In [22]:
result = emp.groupby('job')['sal'].mean().reset_index()
print(result);

         job          sal
0    ANALYST  3000.000000
1      CLERK  1037.500000
2    MANAGER  2758.333333
3  PRESIDENT  5000.000000
4   SALESMAN  1400.000000

In [32]:
result = emp.groupby('deptno')['sal'].max().reset_index(),index
print (result[['detno','sal'][result['deptno'!= 20 ]])

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' (2916221381.py, line 2)

Q4) 위에서 평균월급을 출력할 때 사용되는 정수 부분만 출력해보자.

In [41]:
result =emp.groupby('deptno')['sal'].mean().reset_index().astype(int)
print(result)

   deptno   sal
0      10  2916
1      20  2175
2      30  1566

Q5) 부서위치, 부서별 월급식의 합을 구해보자.
select loc, sum(e.sal)
from emp e, dept d
where e.deptno = deptno
group by d.loc;

In [10]:
emp = pd.read_csv ('../DB_work/csv/emp.csv')
dept = pd.read_csv ('../DB_work/csv/dept.csv')

result = pd.merge(emp, dept, on = 'deptno')
#groupby loc, selest loc, sum = (sal)
result02 = result.groupby('loc')['sal'].sum().reset_index()
print(result02)

        loc      sal
0   CHICAGO   9400.0
1    DALLAS  10875.0
2  NEW YORK   8750.0

select d.loc, e.sal

from emp join dept nusion(deptno) -> from emp join on(emp.deptno = dept.d)

pandas.merge( emp_left, dept_right, how='inner', on='deptno')

how ='inner' : emp 와 dept 데이터 프레임에 공통적으로 존재하는 교집합일 경우에만 추출하겠다.
        
how ='outer' : 열의 데이터가 양쪽 데이터 프레임에 공통적으로 존재하는 교집합이 아니어도 추출하겠다.
                           
how ='left'  : 왼쪽 데이터 프레임의 키열에 속하는 데이터값을
                           기준으로 병합하겠다.
        
how = 'right' :  오른쪽 데이터 프레임의 키열에 속하는 데이터 값을
                           기준으로 병합하겠다.

Q6) select loc, sum(sal)
    from emp outer right join dept using(deptno)
    groupby loc;

In [12]:
result = pd.merge(emp, dept, how = 'right', on='deptno')
result02 = result.groupby('loc')['sal'].sum().reset_index()
print(result02)

        loc      sal
0    BOSTON      0.0
1   CHICAGO   9400.0
2    DALLAS  10875.0
3  NEW YORK   8750.0

In [ ]:
Q7) csv모듈을 이용해서 emp.csv를 읽어오자.

In [13]:
import csv

In [14]:
print(dir(csv))

['Dialect', 'DictReader', 'DictWriter', 'Error', 'QUOTE_ALL', 'QUOTE_MINIMAL', 'QUOTE_NONE', 'QUOTE_NONNUMERIC', 'Sniffer', 'StringIO', '_Dialect', '__all__', '__builtins__', '__cached__', '__doc__', '__file__', '__loader__', '__name__', '__package__', '__spec__', '__version__', 'excel', 'excel_tab', 'field_size_limit', 'get_dialect', 'list_dialects', 're', 'reader', 'register_dialect', 'unix_dialect', 'unregister_dialect', 'writer']

In [28]:
file = open('../DB_work/csv/emp02.csv')
emp_res = csv.reader(file)

#print(type(emp_res))
#print(dir(emp_res))
for m_list in emp_res:
    print(m_list)

['7369', 'SMITH', 'CLERK', '7902', '1980-12-17', '800.00', 'NULL', '20']
['7499', 'ALLEN', 'SALESMAN', '7698', '1981-02-20', '1600.00', '300.00', '30']
['7521', 'WARD', 'SALESMAN', '7698', '1981-02-22', '1250.00', '500.00', '30']
['7566', 'JONES', 'MANAGER', '7839', '1981-04-02', '2975.00', 'NULL', '20']
['7654', 'MARTIN', 'SALESMAN', '7698', '1981-09-28', '1250.00', '1400.00', '30']
['7698', 'BLAKE', 'MANAGER', '7839', '1981-05-01', '2850.00', 'NULL', '30']
['7782', 'CLARK', 'MANAGER', '7839', '1981-06-09', '2450.00', 'NULL', '10']
['7788', 'SCOTT', 'ANALYST', '7566', '1987-04-19', '3000.00', 'NULL', '20']
['7839', 'KING', 'PRESIDENT', 'NULL', '1981-11-17', '5000.00', 'NULL', '10']
['7844', 'TURNER', 'SALESMAN', '7698', '1981-09-08', '1500.00', '0.00', '30']
['7876', 'ADAMS', 'CLERK', '7788', '1987-05-23', '1100.00', 'NULL', '20']
['7900', 'JAMES', 'CLERK', '7698', '1981-12-03', '950.00', 'NULL', '30']
['7902', 'FORD', 'ANALYST', '7566', '1981-12-03', '3000.00', 'NULL', '20']
['7934', 'MILLER', 'CLERK', '7782', '1982-01-23', '1300.00', 'NULL', '10']

In [23]:
Q8) emp_res 객체를 통해서 이름과 봉급을 구하자. 단 봉급은 월급의 11*11.2로 구해자.

In [66]:
file = open('../DB_work/csv/emp02.csv')
emp_res = csv.reader(file)
for m_list in emp_res:
    r = float(list[5])*11.2
print(m_list, rounds)

TypeError: unsupported operand type(s) for *: 'types.GenericAlias' and 'float'

Q8) emp_res 에서 직업이 'SALESNAME' 인 사원의 이름과 직업을 출력 바람.

In [45]:
file = open('../DB_work/csv/emp02.csv')
emp_res = csv.reader(file)
for m_list in emp_res:
    if m_list[2] == 'SALESMAN':
        print(m_list[1], m_list[2])

ALLEN SALESMAN
WARD SALESMAN
MARTIN SALESMAN
TURNER SALESMAN

Q9) emp.csv 를 결측치 확인 하자.
결측치 NaN = Not a Number

In [57]:
emp = pd.read_csv('../DB_work/csv/emp.csv')

#emp.csv의 결측치 개수를 확인해보자.
print(emp[['ename','comm']][emp['comm'].isnull()])
#print(emp.isnull())

In [62]:
#emp.csv의 결측치 개수를 확인해보자.
print(emp.isnull().sum())

empno        0
ename        0
job          0
mgr          1
hiredate     0
sal          0
comm        10
deptno       0
dtype: int64

In [ ]:
 Q10) 파생 데이터 생성 = 파생변수 = 기존의 데이터를 가지고 가공해서 만든 새로운 데이터의 컬럼

In [67]:
#emp 에 있는 sal을 sal02라는 컬럼을 생성해서 추가하자
emp = pd.read_csv('../DB_work/csv/emp.csv')
emp['sal02'] = ['sal']

ValueError: Length of values (1) does not match length of index (14)

In [71]:
#Q11) 이름과 부서 위치를 출력 해보자.
emp = pd.read_csv('../DB_work/csv/emp.csv')
dept = pd.read_csv('../DB_work/csv/dept.csv')

result = pd.merge(emp, dept, how='inner', on='deptno')
print(result[['ename','loc']])

     ename       loc
0    SMITH    DALLAS
1    JONES    DALLAS
2    SCOTT    DALLAS
3    ADAMS    DALLAS
4     FORD    DALLAS
5    ALLEN   CHICAGO
6     WARD   CHICAGO
7   MARTIN   CHICAGO
8    BLAKE   CHICAGO
9   TURNER   CHICAGO
10   JAMES   CHICAGO
11   CLARK  NEW YORK
12    KING  NEW YORK
13  MILLER  NEW YORK